snlkuharlocal/src/DataProcessors/ВыгрузкаПодтвержденийОзон/ВыгрузкаПодтвержденийОзон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаПодтвержденийОзон</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/СостояниеНакладнойУКлиента/СостояниеНакладнойУКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеНакладнойУКлиента</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеУКлиента</name>
    <type>
      <types>CatalogRef.СостояниеНакладнойУКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыДокументов/РеквизитыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыДокументов</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>DocumentRef.Матрица</types>
      <types>Boolean</types>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef.Перемещение</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Матрица</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
      <types>DocumentRef.ЗаданиеНабора</types>
      <types>DocumentRef.СчетФактура</types>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыРНКПНКПРМ/РеквизитыРНКПНКПРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыРНКПНКПРМ</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ИнформацияШКЛН_FBS/ИнформацияШКЛН_FBS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформацияШКЛН_FBS</name>
  <attributes>
    <name>НомерЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробкиЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ШКЛистаНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыОплаты/ВидыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОплаты</name>
  <enumValues>
    <name>НАЛ</name>
    <comment>Наличные</comment>
  </enumValues>
  <enumValues>
    <name>БН</name>
    <comment>Без нал</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/ВыгрузкаПодтвержденийОзон/ObjectModule.bsl
Перем Накладная,ТЗТоварыОбщая;



Процедура ДополнитьСтруктуруЗаказаFBS(СтруктураЗаказа) Экспорт
	//вместо ЗагрузитьвРНК
	
	если Накладная=Неопределено тогда
		СоздатьРНК(СтруктураЗаказа);
	КонецЕсли;

	
	ДТ = СтруктураЗаказа.created_at;
	ПДТ = Лев(ДТ,СтрНайти(ДТ,"T",,,1)-1);
	Год  = Лев(ПДТ,4);
	День = Прав(ПДТ,2);
	Месяц = Сред(ПДТ,6,2);

	ДатаЗаказа=НачалоДня(Дата(год,месяц,день));

	
	ДТ = СтруктураЗаказа.shipment_date;
	ПДТ = Лев(ДТ,СтрНайти(ДТ,"T",,,1)-1);
	Год  = Лев(ПДТ,4);
	День = Прав(ПДТ,2);
	Месяц = Сред(ПДТ,6,2);
	
	ДатаДоставки=НачалоДня(Дата(год,месяц,день));
	ТекущееВремя =  час(ТекущаяДата()) ;
	СтрокаТЗ.НомерЗаказа=СтруктураЗаказа.posting_number;
	СтрокаТЗ.ДатаЗаказа=ДатаЗаказа;
	
	
	СтруктураЗаказа=новый Структура();
	СтруктураЗаказа.Вставить("НомерЗаказа",СтруктураЗаказа.posting_number);
	СтруктураЗаказа.Вставить("ДатаЗаказа",ДатаЗаказа);	
	
	ТЗТоваров=новый ТаблицаЗначений;
	ТЗТоваров.Колонки.Добавить("Номенклатура");
	ТЗТоваров.Колонки.Добавить("Количество");
	ТЗТоваров.Колонки.Добавить("Цена");
	


	
	
	ПризнакВерногоВремени=Истина;
	Если ТекущееВремя>=14 И ДатаДоставки<=НачалоДня(ТекущаяДата()+24*60*60) тогда	 
		ПризнакВерногоВремени = ложь;
		возврат;
	КонецЕсли;	
	
	
	// загрузим товары из заказа
	ЕстьВсеТовары=истина;
	Для каждого ТекСтр из СтруктураЗаказа.products Цикл
		
		Ном = Справочники.Номенклатура.ПустаяСсылка();
		
		Артикул = ТекСтр.sku;   // или offer_id??? 
		ШК = "";
		Наименование = ТекСтр.name;
		Ном = НайтиПОШКМатрица2(ШК,Артикул,Контрагент);
		Кол = ТекСтр.quantity;
		Цена = ТекСтр.price;
		
		Если Ном = Справочники.Номенклатура.ПустаяСсылка() ТОгда
			КритическиеОшибкиОзон.Добавить("Для заказа "+номерзаказа+" Не найдена номенклатура "+Наименование+", артикул -" + артикул+ " количество - "+кол+ "   цена - "+цена );
			естьвсеТовары=ЛОжь;
			продолжить;
		КонецЕсли;	
		
		
		Если кол >0 Тогда
			Нов = ТЗТоваров.Добавить();
			Нов.Номенклатура = Ном;
			Нов.Количество = кол;	
			Нов.Цена = Цена;				
		КонецЕсли;	
		
	КонецЦикла;
	
	если ЕстьВсеТовары и ТЗТоваров.Итог("Количество")>0 тогда
		Для каждого СтрТЗ из ТЗТоваров цикл
			СтрТЗобщ=ТЗТоварыОбщая.добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗобщ,СтруктураЗаказа);
			ЗаполнитьЗначенияСвойств(СтрТЗобщ,СтрТЗ);
		КонецЦикла;
	КонецЕсли;

	//Накладная.ПолучитьФорму("ФормаДокумента").Открыть();;

	//---------------------------------------------------------------------------------------
	
		
КонецПРоцедуры	

Процедура ПостОбработкаРНКFBS()
	
	ПересчетТЧ(Накладная,"Товары",Накладная.Валюта,Накладная.Валюта,Накладная.Курс,Накладная.Курс,Истина);	
	НакладнаяСсылка		=Накладная.ссылка;
	ВидНакладной		=НакладнаяСсылка.Метаданные().Имя;
	ТипУзла=ПараметрыСеанса.ЭтотУзел.ТипУзла;
	
	попытка
		если ЗначениеЗаполнено(НакладнаяСсылка.ТипДоставки) тогда
			ТекТипДоставки=НакладнаяСсылка.ТипДоставки;
		иначе
			ТекТипДоставки=НакладнаяСсылка.ПунктДоставки.ТипДоставки;
		КонецЕсли;
	Исключение
		ТекТипДоставки=НакладнаяСсылка.ПунктДоставки.ТипДоставки;
	КонецПопытки;
	
	
	НакладнаяОбъект=ДокОбъект;
	// комплектующие заполним.
	
	//--------------------------------------------------------------------------------------
	//заполним комплектующие.
	
	
	Накладная.Комплектующие.Очистить();
	
	Для Каждого СтрокаТоваров Из Накладная.Товары Цикл	
		
		Если СтрокаТоваров.Количество = 0 Тогда 
			Продолжить 
		КонецЕсли; 
		
		Номенклатура = СтрокаТоваров.Номенклатура;
		
		Если Номенклатура.Коплектующие.Количество() > 0 Тогда
			// комплект
			Для Каждого СтрокаКомплекта Из Номенклатура.Коплектующие Цикл
				Если СтрокаКомплекта.Количество = 0 Тогда 
					Продолжить 
				КонецЕсли; 
				
				СтрокаТЧ = Накладная.Комплектующие.Добавить();	
				
				СтрокаТЧ.Продукция		= Номенклатура;
				СтрокаТЧ.Номенклатура	= СтрокаКомплекта.Номенклатура;
				
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, ЭтотОбъект);
				
				СтрокаТЧ.Единица		= СтрокаКомплекта.Единица;
				СтрокаТЧ.Коэффициент	= СтрокаКомплекта.Коэффициент;
				СтрокаТЧ.Количество		= СтрокаКомплекта.Количество * СтрокаТоваров.Количество * СтрокаТоваров.Коэффициент; // и разделить на СтрокаКомплекта.Коэффициент?
				РассчитатьСуммуТабЧасти(СтрокаТЧ, Накладная);
				
				Накладная.ОтгрузкаКомплектов =истина;
			КонецЦикла; 
		Иначе			
			// обычный товар
			СтрокаТЧ = Накладная.Комплектующие.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТоваров);
			СтрокаТЧ.Продукция = Номенклатура;
		КонецЕсли;
		
	КонецЦикла;	
	//нечаева 02,02,21
	Если НЕ Накладная.ОтгрузкаКомплектов =истина Тогда
		Накладная.Комплектующие.Очистить();
	КонецЕсли;	
	// нечаева 02,02,21 ---

	
	//----------------------------------------------------------------------------------------
	//                     первичная запись документа!!!!!!!!
	//----------------------------------------------------------------------------------------
	Попытка
		Накладная.Записать(режимЗаписиДокумента.Запись);	
	Исключение
		ЗаписатьВЛог("ОшибкиЕкод"," ! ошибка первичной записи документа  "+ ОписаниеОшибки(),"Информация"); 			
		Инфо = ИнформацияОбОшибке();
		Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
			ОбновитьНумерациюОбъектов();
			УстановитьНомерДокумента2(ЭтотОбъект);
			Попытка
				Накладная.Записать(режимЗаписиДокумента.Запись);
			Исключение
				ЗаписатьВЛог("ОшибкиЕкод"," !ошибка первичной записи документа2 "+ ОписаниеОшибки(),"Информация"); 
				возврат;			
			КонецПопытки;
		Иначе	
			ЗаписатьВЛог("ОшибкиЕкод"," !ошибка первичной записи документа3 "+ ОписаниеОшибки(),"Информация"); 
			возврат;
		КонецЕсли;
	КонецПопытки;
	
	Попытка
		
		//-------------------------------
		Статус = "awaiting_packaging";
		
		ИмСпр = Справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию(статус);				
		Если имСпр = справочники.СостояниеНакладнойУКлиента.ПустаяСсылка() тогда
		КонецЕсли;	
		МенеджерЗаписи = РегистрыСведений.СостояниеНакладнойУКлиента.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Объект = Накладная.ссылка;
		МенеджерЗаписи.Дата = ТекущаяДата();
		МенеджерЗаписи.СостояниеУклиента = ИмСпр;
		
		МенеджерЗаписи.Записать();
		
		//------------------------------------------------------------------------------------------------
		
		ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
		ЗаписьВРег.Документ=Накладная.Ссылка;
		ЗаписьВРег.ИмяРеквизита="ИнтернетЗаказ";
		//	ЗаписьВРег.Период=Накладная.Ссылка.Дата;
		ЗаписьВРег.ЗначениеРеквизита="Да";
		ЗаписьВРег.Записать();
		
		ШкЗаписаны = истина;					  
		Если  СтруктураЗаказа.barcodes <> Неопределено тогда
			ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
			ЗаписьВРег.Документ=Накладная.Ссылка;
			ЗаписьВРег.ИмяРеквизита="ВерхнийШКЭтикетки";
			//	ЗаписьВРег.Период=Накладная.Ссылка.Дата;
			ЗаписьВРег.ЗначениеРеквизита=СтруктураЗаказа.barcodes.upper_barcode;
			ЗаписьВРег.Записать();
			
			ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
			ЗаписьВРег.Документ=Накладная.Ссылка;
			ЗаписьВРег.ИмяРеквизита="НижнийШКЭтикетки";  // его использовать для ЛН, в верхнем лишние знаки
			//	ЗаписьВРег.Период=Накладная.Ссылка.Дата;
			ЗаписьВРег.ЗначениеРеквизита=СтруктураЗаказа.barcodes.lower_barcode;
			ЗаписьВРег.Записать();
			
			ЗаписьВРег=РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьМенеджерЗаписи();
			ЗаписьВРег.Документ=Накладная.Ссылка;
			ЗаписьВРег.ИмяРеквизита="НижнийШКЭтикетки";  // его использовать для ЛН, в верхнем лишние знаки
			//	ЗаписьВРег.Период=Накладная.Ссылка.Дата;
			ЗаписьВРег.ЗначениеРеквизита=СтруктураЗаказа.barcodes.lower_barcode;
			ЗаписьВРег.Записать();
			// нечаева 05,02,21-+++
			Если  СтруктураЗаказа.barcodes.lower_barcode ="0" Тогда
				// перезаписать шк
				
				КритическиеОшибкиОзон2.Добавить("Заказ "+Накладная.Ссылка+"нулевой ШК!");
				СообщитьКритОшибки();
				КритическиеОшибкиОзон2.очистить();
				ШкЗаписаны=ложь;
				
			КонецЕсли;	
				
			
			попытка 
				ЗаписьВРег=РегистрыСведений.ИнформацияШКЛН_FBS.СоздатьМенеджерЗаписи();
				ЗаписьВРег.ШК=Строка(СтруктураЗаказа.barcodes.lower_barcode);
				ЗаписьВРег.ШКЛистаНабора=Строка(СтруктураЗаказа.barcodes.lower_barcode);
				ЗаписьВРег.год = НачалоГода(ТекущаяДата());
				ЗаписьВРег.накладная = Накладная.Ссылка;
				ЗаписьВРег.НомерНакладной = Накладная.Номер; 
				ЗаписьВРег.Записать();
			исключение
				// сообщить(ОписаниеОшибки());
				КритическиеОшибкиОзон2.Добавить("Заказ "+Накладная.Ссылка+"не записаны ШК!"+ОписаниеОшибки());
				СообщитьКритОшибки();
				КритическиеОшибкиОзон2.очистить();
				ШкЗаписаны=ложь;
				
			конецпопытки;
			
		Иначе
			
			КритическиеОшибкиОзон2.Добавить("Заказ "+Накладная.Ссылка+"не записаны ШК! не пришли от Озона в запросе");
			СообщитьКритОшибки();
			КритическиеОшибкиОзон2.очистить();
			ШкЗаписаны=ложь;
		КонецЕсли;
		
		
		
		//Файлы.Добавить("Создан документ: "+Накладная.Дата+" "+Накладная.Номер+", склад: "+Накладная.Склад+".");
		//Сообщить("Записан документ - "+Накладная.Дата+" "+Накладная.Номер);
	Исключение
		КритическиеОшибкиОзон2.Добавить("Заказ "+Накладная.Ссылка+"не записаны ШК! "+ОписаниеОшибки());
		СообщитьКритОшибки();
		КритическиеОшибкиОзон2.очистить();
		ШкЗаписаны=ложь;
	КонецПопытки;
	

	//---------------------------------------------------------------------------------------
	
	ТабОстатков = ПолучитьОстатокТовара(Накладная.Комплектующие.Выгрузитьколонку("Номенклатура"));
	хватает = 1;
	ДЛя  каждого ТекСтрока из  Накладная.Комплектующие цикл
		
		колОст = 0;
		НайденнаяСтрока = ТабОстатков.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		Если НайденнаяСтрока <> Неопределено ТОгда
			КолОст=НайденнаяСтрока.КолКонФакт; 
		Иначе
			колОст = 0;
		КонецЕсли;
		
		Если КолОст - Текстрока.Количество<0 ТОгда
			хватает =0;
			прервать;
		КонецЕсли;	
		
	конецЦикла;
	// Если не хватает товара, то не проводим и не сбрасываем на склад. Будут сбрасывать вручную
	Если Не Хватает Тогда
		
		Ошибки.Добавить("Для РНК "+Накладная+" Не хватает номенклатуры на остатках. Документ не проведен и не сброшен на склад!");
		
		СообщитьМенеджеру(Накладная);  //+++
		
		Ошибки.Очистить();
		//файлы.Очистить();
		
		возврат;
		
	конецЕсли;
	
	//-------------------------------------------------------------------------------------------------------------------
	// сбросим на склад, если все есть на остатках
	//нечаева 21,09,21+++
	
		
	Если Не ПризнакВерногоВремени  Тогда
		
		СообщитьМенеджеруНеПроведен(Накладная);  //+++
		Ошибки.Очистить();
		возврат;
		
	КонецЕсли;
	

	 //нечаева 21,09,21---
	
	
	Если  ПризнакВерногоВремени  Тогда
		
		
		Если ЗначениеНеЗаполнено(НакладнаяОбъект.ДатаВыгрузки) Тогда
			НакладнаяОбъект.ДатаВыгрузки=ТекущаяДата();			
		КонецЕсли; 
		НакладнаяОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад; 		
		
		
		НакладнаяОбъект.дата=ТекущаяДата();
		//НакладнаяОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		попытка
			НакладнаяОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		исключение
			//КритическиеОшибкиОзон2.Добавить("Заказ "+Накладная.НомерЗаказа+" не проведен первый раз и не сброшен на склад!");
			//КритическиеОшибкиОзон.Добавить("Заказ "+Накладная.НомерЗаказа+" не проведен и не сброшен на склад!"+НакладнаяОбъект);
			
			//КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
			//
			//СообщитьКритОшибки();
			//КритическиеОшибкиОзон2.очистить();
			
			ШкЗаписаны=ложь;
			
			//СообщитьМенеджеру(Накладная);  //+++
			Если  КритическиеОшибкиОзон.количество()>0 Тогда
				СообщитьМенеджеруОзон(Накладная);
				КритическиеОшибкиОзон.очистить();
			КонецЕсли; 
			//Ошибки.Очистить();
			
			возврат;
			
		конецпопытки;
		//------------------------------------------------------------------------------------------------------------------
		// еще раз проверим
		
		Если  НЕ Накладная.Проведен Тогда
			//КритическиеОшибкиОзон2.Добавить("Заказ "+Накладная+" не проведен и не сброшен на склад!");
			//	КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
			ЗаписатьВЛог("ОшибкиЕкод","Заказ "+Накладная.НомерЗаказа+" не проведен и не сброшен на склад !2","Информация");
			
			//СообщитьКритОшибки();
			//КритическиеОшибкиОзон2.очистить();
			возврат;
		конецЕсли;
		
		//----------------------------------------------------------------------------------------------------------------------	
		
		// если не собрали - соберем.
		СобратьЗаказыОзон(НакладнаяОбъект);
		
	КонецЕсли;


	//------------------------------------------------------------------------------------------------------------------
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеру(Накладная);  //+++
		Ошибки.Очистить();
		
	КонецЕсли;


	
	Если  КритическиеОшибкиОзон.количество()>0 Тогда
		СообщитьМенеджеруОзон(Накладная);
		КритическиеОшибкиОзон.очистить();
	КонецЕсли; 
	
	
	
	
	// попробуем еще раз получить ШК
	//попытка
	//	Если   ШкЗаписаны=ложь Тогда
			
			ИнфоОбОтправлении(Накладная.НомерЗаказа,Накладная.Ссылка);
			
	//	КонецЕсли;	
	//Исключение
	//конецПопытки;
	//
			

КонецПроцедуры

Процедура СоздатьРНК(СтруктураЗаказа) Экспорт
	


	
	ДТ = СтруктураЗаказа.created_at;
	ПДТ = Лев(ДТ,СтрНайти(ДТ,"T",,,1)-1);
	Год  = Лев(ПДТ,4);
	День = Прав(ПДТ,2);
	Месяц = Сред(ПДТ,6,2);

	ДатаЗаказа=НачалоДня(Дата(год,месяц,день));

	
	ДТ = СтруктураЗаказа.shipment_date;
	ПДТ = Лев(ДТ,СтрНайти(ДТ,"T",,,1)-1);
	Год  = Лев(ПДТ,4);
	День = Прав(ПДТ,2);
	Месяц = Сред(ПДТ,6,2);
	
	ДатаДоставки=НачалоДня(Дата(год,месяц,день));
	ТекущееВремя =  час(ТекущаяДата()) ;
	
	СтруктураСтроки=новый Структура();
	СтруктураСтроки.Вставить("НомерЗаказа",СтруктураЗаказа.posting_number);
	СтруктураСтроки.Вставить("ДатаЗаказа",ДатаЗаказа);

	
	Попытка
		ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
		ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		
	Исключение
	КонецПопытки;
	
	ПризнакВерногоВремени=Истина;
	Если ТекущееВремя>=14 И ДатаДоставки<=НачалоДня(ТекущаяДата()+24*60*60) тогда
		 
		ПризнакВерногоВремени = ложь;
		возврат;
	КонецЕсли;	
	
	Шапка=Новый Структура();
	Шапка.Вставить("Контрагент",справочники.Контрагенты.НайтиПоКоду("SSP-4991"));
	Шапка.Вставить("ПунктДоставки",справочники.ПунктыДоставки.НайтиПоКоду("SNL-024660"));
	Шапка.Вставить("Организация",Справочники.Организации.НайтиПоКоду("SS-001"));
	Шапка.Вставить("Договор",Справочники.Договоры.НайтиПоКоду("SNL-028617"));
	Шапка.Вставить("Склад",Справочники.Склады.НайтиПоКоду("STC-81"));
	Шапка.Вставить("ИБ",Справочники.ИБ.НайтиПоКоду("SSP"));
	Шапка.Вставить("ТипЦен",Шапка.Контрагент.ТипЦен);
	Шапка.Вставить("ОтсрочкаПлатежа",Шапка.Договор.ОтсрочкаПлатежа);
	Шапка.Вставить("Дата",ТекущаяДата());
	Шапка.Вставить("ПереданПокупателюВЭлВиде",Истина);
	Шапка.Вставить("ВидОплаты",Перечисления.ВидыОплаты.БН);
	Шапка.Вставить("Менеджер",Шапка.Контрагент.Менеджер);
	Шапка.Вставить("Подразделение",Шапка.Менеджер.подразделение);
	Шапка.Вставить("ЛевыйКонтрагент",Шапка.Контрагент);
	Шапка.Вставить("СостояниеНакладной",Перечисления.СостоянияНакладной.ВРаботе);
	Шапка.Вставить("Отгружен",Перечисления.Отгружен.Резерв);
	Шапка.Вставить("КодОперации",перечисления.КодыОперацийОстатки.Комиссия);
	Шапка.Вставить("Валюта",Справочники.Валюты.НайтиПоКоду("810"));
	Шапка.Вставить("ДатаОформления",Шапка.дата);
	Шапка.Вставить("СкидкаКонтрагента",ПолучитьРеквизитРодителя(Шапка.Контрагент,"Скидка"));	
	Шапка.Вставить("ДатаОтгрузки",ДатаОтгрузки);
	Шапка.Вставить("ДатаЗаказа",ДатаЗаказа);
	
	Накладная=документы.РасходнаяНакладная.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(Накладная,Шапка);
	ЗаполнитьШапкуДокумента(Накладная, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	ЗаполнитьЗначенияСвойств(Накладная,Шапка);

	Накладная.ДопОбработки.Очистить();
	Если Накладная.ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
		Для Каждого СтрокаТЧ Из Накладная.Контрагент.ВидыДопОбработок Цикл
			СтрокаДО=Накладная.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТЧ Из Накладная.ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО=Накладная.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
		
	КонецЕсли;
	КодПоставщикаПунктаДоставки=Накладная.ПунктДоставки.КодПоставщика;
	Если НЕ КодПоставщикаПунктаДоставки.Пустая() И Накладная.КодПоставщика<>КодПоставщикаПунктаДоставки Тогда
		Накладная.КодПоставщика=КодПоставщикаПунктаДоставки;
	КонецЕсли; 
	
	ПунктДоставки_ПриИзменении(Накладная.ПунктДоставки,ДокОбъект);

КонецПРоцедуры
